## Staging: api_gateway
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| delete | `aws_api_gateway_resource.problem_email`                 |
|        | `aws_api_gateway_resource.toptask_email`                 |
| add    | `aws_api_gateway_deployment.feedback_api`                |
|        | `aws_api_gateway_integration.problem_form_lambda`        |
|        | `aws_api_gateway_integration.toptask_survey_form_lambda` |
|        | `aws_api_gateway_stage.feedback_api`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.feedback_api will be created
  + resource "aws_api_gateway_deployment" "feedback_api" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "mk3lig0o8j"
      + triggers      = (known after apply)
    }

  # aws_api_gateway_integration.problem_form_lambda will be created
  + resource "aws_api_gateway_integration" "problem_form_lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "oueb05"
      + rest_api_id             = "mk3lig0o8j"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:992382783569:function:feedback-collection-api-queue-problem-form/invocations"
    }

  # aws_api_gateway_integration.toptask_survey_form_lambda will be created
  + resource "aws_api_gateway_integration" "toptask_survey_form_lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "6ykd8c"
      + rest_api_id             = "mk3lig0o8j"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:992382783569:function:feedback-collection-api-queue-toptask-survey-form/invocations"
    }

  # aws_api_gateway_resource.problem_email will be destroyed
  # (because aws_api_gateway_resource.problem_email is not in configuration)
  - resource "aws_api_gateway_resource" "problem_email" {
      - id          = "9ecfer" -> null
      - parent_id   = "soycqr" -> null
      - path        = "/problem/email" -> null
      - path_part   = "email" -> null
      - rest_api_id = "mk3lig0o8j" -> null
    }

  # aws_api_gateway_resource.toptask_email will be destroyed
  # (because aws_api_gateway_resource.toptask_email is not in configuration)
  - resource "aws_api_gateway_resource" "toptask_email" {
      - id          = "jnr3fs" -> null
      - parent_id   = "a0oa4h" -> null
      - path        = "/toptask/email" -> null
      - path_part   = "email" -> null
      - rest_api_id = "mk3lig0o8j" -> null
    }

  # aws_api_gateway_stage.feedback_api will be created
  + resource "aws_api_gateway_stage" "feedback_api" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = "mk3lig0o8j"
      + stage_name           = "staging"
      + tags                 = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + web_acl_arn          = (known after apply)
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/apigateway/feedback-collection-api"
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + api_gateway_invoke_url       = (known after apply)
  + problem_form_endpoint        = (known after apply)
  + toptask_survey_form_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
